# Tasks – Data Cleaning, Missing Data, Outliers

## Part 1 – Data Cleaning

### 1.Check dataset structure

In [ ]:
import pandas as pd

df = pd.read_csv("bi.csv", encoding="latin1")  # Load CSV file into a DataFrame

df  # Display rows

,fNAME,lNAME,Age,gender,country,residence,entryEXAM,prevEducation,studyHOURS,Python,DB
0,Christina,Binger,44,Female,Norway,Private,72,Masters,158,59.0,55
1,Alex,Walekhwa,60,M,Kenya,Private,79,Diploma,150,60.0,75
2,Philip,Leo,25,Male,Uganda,Sognsvann,55,HighSchool,130,74.0,50
3,Shoni,Hlongwane,22,F,Rsa,Sognsvann,40,High School,120,NaN,44
4,Maria,Kedibone,23,Female,South Africa,Sognsvann,65,High School,122,91.0,80
...,...,...,...,...,...,...,...,...,...,...,...
72,Clara,Bernard,43,Female,France,Private,80,Bachelors,150,75.0,43
73,Julian,Nielsen,31,Male,Denmark,Sognsvann,90,Masters,158,84.0,83
74,Sophie,Brown,33,Female,UK,Sognsvann,96,Masters,158,85.0,90
75,Leon,Bauer,35,Male,Germany,Sognsvann,90,Masters,160,87.0,74
76,Mohammed,Salim,31,Male,Somali,Sognsvann,35,Masters,144,72.0,90

In [143]:
df.shape

(77, 11)

#### Apply info() to know number of non-null values

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 77 entries, 0 to 76
Data columns (total 11 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   fNAME          77 non-null     object
 1   lNAME          77 non-null     object
 2   Age            77 non-null     int64
 3   gender         77 non-null     object
 4   country        77 non-null     object
 5   residence      77 non-null     object
 6   entryEXAM      77 non-null     int64
 7   prevEducation  77 non-null     object
 8   studyHOURS     77 non-null     int64
 9   Python         75 non-null     float64
 10  DB             77 non-null     int64
dtypes: float64(1), int64(4), object(6)
memory usage: 6.7+ KB

In [144]:
df.head()

,fNAME,lNAME,Age,gender,country,residence,entryEXAM,prevEducation,studyHOURS,Python,DB
0,Christina,Binger,44,Female,Norway,Private,72,Masters,158,59.0,55
1,Alex,Walekhwa,60,M,Kenya,Private,79,Diploma,150,60.0,75
2,Philip,Leo,25,Male,Uganda,Sognsvann,55,HighSchool,130,74.0,50
3,Shoni,Hlongwane,22,F,Rsa,Sognsvann,40,High School,120,81.0,44
4,Maria,Kedibone,23,Female,South Africa,Sognsvann,65,High School,122,91.0,80

#### Question: Which columns should be categorical and which should be numerical?

##### Answer: Age, entryEXAM, studyHOURS, Python, DB Are Numerical Columns but gender, country, residence, prevEducation Are Categorical Columns

### 2.Detect inconsistent categories

#### apply unique() to know the unique values in each column

In [6]:
df['gender'].unique()

array(['Female', 'M', 'Male', 'F', 'female', 'male'], dtype=object)

In [7]:
df['country'].unique()

array(['Norway', 'Kenya', 'Uganda', 'Rsa', 'South Africa', 'Norge',
       'norway', 'Denmark', 'Netherlands', 'Italy', 'Spain', 'UK',
       'Somali', 'Nigeria', 'Germany', 'France'], dtype=object)

In [8]:
df['prevEducation'].unique()

array(['Masters', 'Diploma', 'HighSchool', 'High School', 'Bachelors',
       'Barrrchelors', 'diploma', 'DIPLOMA', 'Diplomaaa', 'Doctorate'],
      dtype=object)

#### Use replace to replace calues that are same in meaning

In [146]:
df = df.replace({"gender": {"Male": "M", "Female": "F","male": "M", "female": "F"},
                 "prevEducation": {"Barrrchelors": "Bachelors", "diploma": "Diploma","Diplomaaa": "Diploma", "High School": "HighSchool","DIPLOMA": "Diploma"}})

In [148]:
df['prevEducation'].unique()

array(['Masters', 'Diploma', 'HighSchool', 'Bachelors', 'Doctorate'],
      dtype=object)

In [147]:
df['gender'].unique()

array(['F', 'M'], dtype=object)

### 3.Handle duplicates

#### Use duplicated().sum() to know number of duplicated rows

In [12]:
df.duplicated().sum()

np.int64(0)

#### Use drop_duplicates() to delete duplicated rows

In [54]:
df.drop_duplicates()

,fNAME,lNAME,Age,gender,country,residence,entryEXAM,prevEducation,studyHOURS,Python,DB
0,Christina,Binger,44,Female,Norway,Private,72,Masters,158,59.0,55
1,Alex,Walekhwa,60,M,Kenya,Private,79,Diploma,150,60.0,75
2,Philip,Leo,25,Male,Uganda,Sognsvann,55,HighSchool,130,74.0,50
3,Shoni,Hlongwane,22,F,Rsa,Sognsvann,40,High School,120,NaN,44
4,Maria,Kedibone,23,Female,South Africa,Sognsvann,65,High School,122,91.0,80
...,...,...,...,...,...,...,...,...,...,...,...
72,Clara,Bernard,43,Female,France,Private,80,Bachelors,150,75.0,43
73,Julian,Nielsen,31,Male,Denmark,Sognsvann,90,Masters,158,84.0,83
74,Sophie,Brown,33,Female,UK,Sognsvann,96,Masters,158,85.0,90
75,Leon,Bauer,35,Male,Germany,Sognsvann,90,Masters,160,87.0,74
76,Mohammed,Salim,31,Male,Somali,Sognsvann,35,Masters,144,72.0,90

In [14]:
df.duplicated().sum()

np.int64(0)

# ____________________________________________________________________________________________________________________________________________________________________

## Part 2 – Missing Data

### 1.Identify missing values

#### Use isnull().sum() to know number of null values in all columns

In [149]:
df.isnull().sum()

fNAME            0
lNAME            0
Age              0
gender           0
country          0
residence        0
entryEXAM        0
prevEducation    0
studyHOURS       0
Python           0
DB               0
dtype: int64

#### Question: Which columns are most affected by missing values?

#### Answer: Python Column

### 3.Impute missing values

In [16]:
df['Python'].unique()

array([59., 60., 74., nan, 91., 88., 80., 85., 83., 79., 70., 75., 87.,
       76., 84., 33., 30., 61., 82., 66., 81., 31., 90., 69., 57., 86.,
       78., 48., 45., 15., 63., 72.])

In [17]:
df['DB'].unique()

array([ 55,  75,  50,  44,  80,  59,  91,  60,  89,  90,  58,  99,  76,
        77,  82,  78,  73,  30,  56,  65,  83,  88,  69,  79,  45,  42,
        70,  74,  33,  92,  86,  62,  47,  67, 100,  61,  46,  68,  71,
        43])

In [18]:
df["Python"].mean()

np.float64(75.85333333333334)

In [150]:
df["Python"].median()

np.float64(81.0)

#### Using isnull() to know where are null value in rows

In [20]:
df[df.isnull().any(axis=1)]

,fNAME,lNAME,Age,gender,country,residence,entryEXAM,prevEducation,studyHOURS,Python,DB
3,Shoni,Hlongwane,22,F,Rsa,Sognsvann,40,HighSchool,120,NaN,44
33,Frank,Abrahamsen,23,M,Norway,BI Residence,68,HighSchool,152,NaN,70

#### Use .fillna to replace these null value by mean or median

In [21]:
try_1 = df["Python"].fillna(df["Python"].mean())
try_1

0     59.000000
1     60.000000
2     74.000000
3     75.853333
4     91.000000
        ...
72    75.000000
73    84.000000
74    85.000000
75    87.000000
76    72.000000
Name: Python, Length: 77, dtype: float64

In [22]:
try_2 = df["Python"].fillna(df["Python"].median())
try_2

0     59.0
1     60.0
2     74.0
3     81.0
4     91.0
      ...
72    75.0
73    84.0
74    85.0
75    87.0
76    72.0
Name: Python, Length: 77, dtype: float64

In [23]:
try_2.mean()

np.float64(75.98701298701299)

In [24]:
try_1.mean()

np.float64(75.85333333333334)

#### I will assume that there are high number of outliers so i will replace non value with median

In [70]:
df["Python"] = df["Python"].fillna(df["Python"].median())
df["Python"]

0     59.0
1     60.0
2     74.0
3     81.0
4     91.0
      ...
72    75.0
73    84.0
74    85.0
75    87.0
76    72.0
Name: Python, Length: 77, dtype: float64

In [71]:
df[df.isnull().any(axis=1)]

Empty DataFrame
Columns: [fNAME, lNAME, Age, gender, country, residence, entryEXAM, prevEducation, studyHOURS, Python, DB]
Index: []

# _______________________________________________________________________________________________________________________________________________________________________________-

## Part 3 – Outliers

### 1.Detect outliers

#### Use .describe() to show mean, median, min, max and quartiles

In [74]:
df['Python'].describe()

count    77.000000
mean     75.987013
std      15.228517
min      15.000000
25%      72.000000
50%      81.000000
75%      85.000000
max      91.000000
Name: Python, dtype: float64

In [76]:
df['studyHOURS'].describe()

count     77.000000
mean     149.714286
std       12.743272
min      114.000000
25%      144.000000
50%      156.000000
75%      158.000000
max      160.000000
Name: studyHOURS, dtype: float64

In [78]:
df['DB'].describe()

count     77.000000
mean      69.467532
std       17.033701
min       30.000000
25%       56.000000
50%       71.000000
75%       83.000000
max      100.000000
Name: DB, dtype: float64

#### Question: Which values in studyHOURS, Python, or DB look unrealistic?

#### We will know after applying IQR

### 2.Handle outliers

In [79]:
Q1 = df['DB'].quantile(0.25)
Q3 = df['DB'].quantile(0.75)
IQR = Q3 - Q1
lower_bound = Q1 - 1.5 * IQR
upper_bound = Q3 + 1.5 * IQR

df_new=df[(df['DB'] >= lower_bound) & (df['DB'] <= upper_bound)]

In [80]:
lower_bound

np.float64(15.5)

In [81]:
upper_bound

np.float64(123.5)

In [82]:
df_new['DB'].describe()

count     77.000000
mean      69.467532
std       17.033701
min       30.000000
25%       56.000000
50%       71.000000
75%       83.000000
max      100.000000
Name: DB, dtype: float64

In [83]:
df_new.describe()

             Age  entryEXAM  studyHOURS     Python          DB
count  77.000000  77.000000   77.000000  77.000000   77.000000
mean   35.207792  76.753247  149.714286  75.987013   69.467532
std    10.341966  16.475784   12.743272  15.228517   17.033701
min    21.000000  28.000000  114.000000  15.000000   30.000000
25%    27.000000  69.000000  144.000000  72.000000   56.000000
50%    33.000000  80.000000  156.000000  81.000000   71.000000
75%    42.000000  90.000000  158.000000  85.000000   83.000000
max    71.000000  98.000000  160.000000  91.000000  100.000000

In [140]:
df.describe()

             Age  entryEXAM  studyHOURS     Python          DB
count  77.000000  77.000000   77.000000  77.000000   77.000000
mean   35.207792  76.753247  149.714286  75.987013   69.467532
std    10.341966  16.475784   12.743272  15.228517   17.033701
min    21.000000  28.000000  114.000000  15.000000   30.000000
25%    27.000000  69.000000  144.000000  72.000000   56.000000
50%    33.000000  80.000000  156.000000  81.000000   71.000000
75%    42.000000  90.000000  158.000000  85.000000   83.000000
max    71.000000  98.000000  160.000000  91.000000  100.000000

### I will do 3 senarios To treat data

#### First Senario: Remove outliers from studyHOURS column then from Python column

In [103]:
Q1 = df_new['studyHOURS'].quantile(0.25)
Q3 = df_new['studyHOURS'].quantile(0.75)
IQR = Q3 - Q1
lower_bound = Q1 - 1.5 * IQR
upper_bound = Q3 + 1.5 * IQR

df_new_2=df_new[(df_new['studyHOURS'] >= lower_bound) & (df_new['studyHOURS'] <= upper_bound)]

In [104]:
lower_bound

np.float64(123.0)

In [105]:
upper_bound

np.float64(179.0)

In [106]:
df_new_2['studyHOURS'].describe()

count     70.000000
mean     152.800000
std        8.481181
min      124.000000
25%      150.000000
50%      156.000000
75%      158.000000
max      160.000000
Name: studyHOURS, dtype: float64

In [107]:
df_new_2.describe()

             Age  entryEXAM  studyHOURS     Python          DB
count  70.000000  70.000000   70.000000  70.000000   70.000000
mean   35.500000  79.757143  152.800000  78.928571   70.942857
std     9.452781  13.276803    8.481181   9.404472   16.348457
min    21.000000  35.000000  124.000000  48.000000   33.000000
25%    28.250000  74.250000  150.000000  75.250000   58.250000
50%    34.500000  81.000000  156.000000  81.000000   73.500000
75%    42.000000  90.000000  158.000000  85.000000   85.250000
max    69.000000  98.000000  160.000000  90.000000  100.000000

In [108]:
df_new.describe()

             Age  entryEXAM  studyHOURS     Python          DB
count  77.000000  77.000000   77.000000  77.000000   77.000000
mean   35.207792  76.753247  149.714286  75.987013   69.467532
std    10.341966  16.475784   12.743272  15.228517   17.033701
min    21.000000  28.000000  114.000000  15.000000   30.000000
25%    27.000000  69.000000  144.000000  72.000000   56.000000
50%    33.000000  80.000000  156.000000  81.000000   71.000000
75%    42.000000  90.000000  158.000000  85.000000   83.000000
max    71.000000  98.000000  160.000000  91.000000  100.000000

In [109]:
Q1 = df_new_2['Python'].quantile(0.25)
Q3 = df_new_2['Python'].quantile(0.75)
IQR = Q3 - Q1
lower_bound = Q1 - 1.5 * IQR
upper_bound = Q3 + 1.5 * IQR

df_new_3=df_new_2[(df_new_2['Python'] >= lower_bound) & (df_new_2['Python'] <= upper_bound)]

In [110]:
lower_bound

np.float64(60.625)

In [111]:
upper_bound

np.float64(99.625)

In [112]:
df_new_3['Python'].describe()

count    64.000000
mean     81.000000
std       6.661903
min      61.000000
25%      79.750000
50%      82.500000
75%      85.250000
max      90.000000
Name: Python, dtype: float64

In [113]:
df_new_3.describe()

             Age  entryEXAM  studyHOURS     Python          DB
count  64.000000  64.000000   64.000000  64.000000   64.000000
mean   35.296875  81.203125  153.906250  81.000000   71.812500
std     9.142053  12.485140    7.280587   6.661903   16.482675
min    21.000000  35.000000  130.000000  61.000000   33.000000
25%    28.750000  76.000000  152.000000  79.750000   59.000000
50%    33.500000  82.000000  156.000000  82.500000   74.000000
75%    42.000000  90.000000  158.000000  85.250000   86.500000
max    69.000000  98.000000  160.000000  90.000000  100.000000

In [141]:
df_new_2.describe()

             Age  entryEXAM  studyHOURS     Python          DB
count  70.000000  70.000000   70.000000  70.000000   70.000000
mean   35.500000  79.757143  152.800000  78.928571   70.942857
std     9.452781  13.276803    8.481181   9.404472   16.348457
min    21.000000  35.000000  124.000000  48.000000   33.000000
25%    28.250000  74.250000  150.000000  75.250000   58.250000
50%    34.500000  81.000000  156.000000  81.000000   73.500000
75%    42.000000  90.000000  158.000000  85.000000   85.250000
max    69.000000  98.000000  160.000000  90.000000  100.000000

In [157]:
df_new_3.to_csv("cleaned_dataset_Senairo_1.csv", index=False)

#### Second Senario: Remove outliers from Python column then from studyHOURS column

In [115]:
Q1 = df_new['Python'].quantile(0.25)
Q3 = df_new['Python'].quantile(0.75)
IQR = Q3 - Q1
lower_bound = Q1 - 1.5 * IQR
upper_bound = Q3 + 1.5 * IQR

df_new_4=df_new[(df_new['Python'] >= lower_bound) & (df_new['Python'] <= upper_bound)]

In [116]:
lower_bound

np.float64(52.5)

In [117]:
upper_bound

np.float64(104.5)

In [118]:
df_new_4['Python'].describe()

count    71.000000
mean     79.563380
std       8.674647
min      57.000000
25%      77.000000
50%      81.000000
75%      85.000000
max      91.000000
Name: Python, dtype: float64

In [119]:
Q1 = df_new_4['studyHOURS'].quantile(0.25)
Q3 = df_new_4['studyHOURS'].quantile(0.75)
IQR = Q3 - Q1
lower_bound = Q1 - 1.5 * IQR
upper_bound = Q3 + 1.5 * IQR

df_new_5=df_new_4[(df_new_4['studyHOURS'] >= lower_bound) & (df_new_4['studyHOURS'] <= upper_bound)]

In [120]:
df_new_5['studyHOURS'].describe()

count     67.000000
mean     153.910448
std        6.754867
min      136.000000
25%      152.000000
50%      156.000000
75%      158.000000
max      160.000000
Name: studyHOURS, dtype: float64

In [155]:
df_new_5.to_csv("cleaned_dataset_Senairo_2.csv", index=False)

#### Third Senario: Replace all outliers with Median Values

In [ ]:
Q1 = df_new['Python'].quantile(0.25)
Q3 = df_new['Python'].quantile(0.75)
IQR = Q3 - Q1
lower_bound = Q1 - 1.5 * IQR
upper_bound = Q3 + 1.5 * IQR

median_value = df_new['Python'].median()

In [123]:
df_new['Python']

0     59.0
1     60.0
2     74.0
3     81.0
4     91.0
      ...
72    75.0
73    84.0
74    85.0
75    87.0
76    72.0
Name: Python, Length: 77, dtype: float64

In [124]:
lower_bound

np.float64(52.5)

In [125]:
upper_bound

np.float64(104.5)

In [128]:
df_new.loc[df['Python'] < lower_bound, 'Python'] = median_value
df_new.loc[df['Python'] > upper_bound, 'Python'] = median_value

In [130]:
df_new.describe()

             Age  entryEXAM  studyHOURS     Python          DB
count  77.000000  77.000000   77.000000  77.000000   77.000000
mean   35.207792  76.753247  149.714286  79.675325   69.467532
std    10.341966  16.475784   12.743272   8.334206   17.033701
min    21.000000  28.000000  114.000000  57.000000   30.000000
25%    27.000000  69.000000  144.000000  78.000000   56.000000
50%    33.000000  80.000000  156.000000  81.000000   71.000000
75%    42.000000  90.000000  158.000000  85.000000   83.000000
max    71.000000  98.000000  160.000000  91.000000  100.000000

In [131]:
Q1 = df_new['studyHOURS'].quantile(0.25)
Q3 = df_new['studyHOURS'].quantile(0.75)
IQR = Q3 - Q1
lower_bound = Q1 - 1.5 * IQR
upper_bound = Q3 + 1.5 * IQR

median_value = df_new['studyHOURS'].median()

In [132]:
df_new['studyHOURS']

0     158
1     150
2     130
3     120
4     122
     ...
72    150
73    158
74    158
75    160
76    144
Name: studyHOURS, Length: 77, dtype: int64

In [133]:
lower_bound

np.float64(123.0)

In [134]:
upper_bound

np.float64(179.0)

In [136]:
df_new.loc[df['studyHOURS'] < lower_bound, 'studyHOURS'] = median_value
df_new.loc[df['studyHOURS'] > upper_bound, 'studyHOURS'] = median_value

In [138]:
df_new.describe()

             Age  entryEXAM  studyHOURS     Python          DB
count  77.000000  77.000000   77.000000  77.000000   77.000000
mean   35.207792  76.753247  153.090909  79.675325   69.467532
std    10.341966  16.475784    8.134044   8.334206   17.033701
min    21.000000  28.000000  124.000000  57.000000   30.000000
25%    27.000000  69.000000  152.000000  78.000000   56.000000
50%    33.000000  80.000000  156.000000  81.000000   71.000000
75%    42.000000  90.000000  158.000000  85.000000   83.000000
max    71.000000  98.000000  160.000000  91.000000  100.000000

In [158]:
df_new.to_csv("cleaned_dataset_Senairo_3.csv", index=False)

### What inconsistencies you found and how you fixed them

####  I did not find major inconsistencies in the dataset. The only issue was with some category values such as “diplomma” and “DIPLOMA”, which I standardized to “Diploma”.

### How missing values were imputed and why

#### The missing values were imputed using both the mean and the median for comparison. In the end, I chose the median because there were outliers in two columns (Python and studyHOURS), and the median is more robust against outliers than the mean.

### How outliers were detected and treated

#### The outliers were detected using the IQR method. I tested three different scenarios to decide on the most appropriate treatment. I found that scenario 3 was the best option because it did not reduce the dataset size and it produced more logical values compared to the other scenarios.